import HeadInfoBox from "@/components/main/HeadInfoBox";
import Button from "@/components/main/Button";

function Page() {
  return (
    <div>
      <HeadInfoBox
        title={"ریچارد باخ"}
        type={"author"}
        text={
          "ریچارد دیوید باخ، زاده ی 23 ژوئن 1936، نویسنده ی آمریکایی است.باخ در اوک پارک ایالت ایلینوی به دنیا آمد و در سال 1955 به کالج دولتی لانگ بیچ رفت. او از همان دوران کودکی عاشق پرواز بود و اولین بار در پانزده سالگی پرواز با هواپیما را تجربه کرد.باخ به عنوان خلبان جنگنده به گارد ملی نیوجرسی پیوست و بعد از آن، در شغل هایی چون نویسنده ی فنی شرکت هوایی داگلاس و دبیر مجله ی Flying مشغول به کار شد.اکثر کتاب های باخ به گونه ای با پرواز مرتبط هستند، از داستان های اولیه ی او گرفته که تماما به پرواز با هواپیما می پردازند، تا آثار بعدی او که از پرواز به عنوان استعاره ای فلسفی بهره می جویند."
        }
        image={"/authorImage.png"}
        secondTitle={"متن تست"}
        buttons={[
          <Button text={"تست"} type={"secondary"} key={"1"} />,
          <Button text={"تست"} type={"secondary"} key={"2"} />,
        ]}
      />
    </div>
  );
}

export default Page;
